Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: །དེ་ཚེ་འོད་རྣམས་ཐམས་ཅད་ཡོང་མི་མངོན།
en: There was no other light at that time When there was the splendor of the Buddha entering the city. {24}

source: །ཚོགས་ཆེན་དང་ནི་བདེ་གཤེགས་ལམ་བཞུད་ཚེ།
en: When with that great assembly the Sugata proceeded on the path,

source: །གང་དུ་སྟོབས་བཅུ་ཡི་ནི་ཞབས་འཇོག་པར།
en: Wherever the feet of the one with the ten strengths trod

source: །ས་ལས་པད་མ་དག་ནི་སྟོང་ཕྲག་བརྒྱ།
en: There appeared from the ground a hundred thousand lotuses

source: །འདབ་མ་བྱེ་བ་སྟོང་ལྡན་གཙང་མ་བྱུང་།
en: That were pure and had ten thousand million petals. {25}

source: །འདྲེན་པ་གྲོང་ཁྱེར་མཆོག་ཏུ་གཤེགས་པའི་ཚེ།
en: When the Guide entered the supreme city,

source: །དེ་ན་ཉལ་ཉིལ་མི་གཙང་མེད་པར་གྱུར།
en: At that time there was no dirt or refuse.

source: །གྲོང་ཁྱེར་ཐམས་ཅད་དྲི་མཆོག་བདུག་པ་ཡི།
en: Throughout the entire city there arose

source: །སྤོས་ངད་ཡིད་དུ་འོང་བ་ཀུན་ནས་ལྡང་།
en: The lovely aroma of the most fragrant incense. {26}

source: །གྲོང་དང་སྲང་རྣམས་ཡོངས་སུ་དག་གྱུར་ཏེ།
en: The entire city and its streets were purified.

source: །རྡོ་དང་གསེག་མ་མེད་ཅིང་སྤོས་ཆུས་བཏབ།
en: They had no stones or gravel and were sprinkled with perfume

source: །སྟོབས་བཅུ་ལྡན་པའི་བསོད་ནམས་དེ་འདྲ་སྟེ། །རྣམ་པ་སྣ་ཚོགས་མེ་ཏོག་སིལ་མ་བཀྲམ།
en: And bestrewn with the petals of various kinds of flowers. That is the kind of merit the one with ten strengths had. {27}

source: །གནོད་སྦྱིན་བརྒྱ་སྟོང་གཏུམ་པོར་སེམས་པ་དག །སངས་རྒྱས་མི་དབང་གསེར་འདྲ་མཐོང་ནས་ནི།
en: When a hundred thousand yakṣas with ferocious minds Saw the Buddha, the Lord of men who was like gold,

source: །འདྲེན་ལ་དགའ་བ་རྒྱ་ཆེ་རབ་བསྐྱེད་ནས།
en: They felt an immense love for the Guide

source: །སངས་རྒྱས་ཆོས་དང་དགེ་འདུན་སྐྱབས་སུ་འགྲོ།
en: And took refuge in the Buddha, Dharma, and Saṅgha. {28}

source: །ལྷ་རྣམས་བྱེ་བ་དང་ནི་བརྒྱ་ཕྲག་སྟོང་།
en: All of the million millions of devas

source: །མི་དབང་ལྟ་བར་འོངས་པ་དེ་དག་ཀུན།
en: Who had come to see the Lord of men

source: །བདེ་བར་གཤེགས་ལ་མེ་ཏོག་ཆར་ཕབ་སྟེ།
en: Let fall a rain of flowers on the Sugata.

source: །མེ་ཏོག་གཏོར་ནས་ནམ་མཁའི་དཀྱིལ་ན་འདུག །རྒྱལ་ལ་མི་ཡིས་མེ་ཏོག་གང་གཏོར་བ།
en: They scattered flowers while in the middle of the sky. {29} The flowers scattered by humans for the Jina

source: །ནམ་མཁའི་ངོས་ལ་མེ་ཏོག་གདུགས་སུ་གྱུར།
en: Formed a parasol of flowers in the sky.

source: །ལྷ་རྣམས་ཀྱིས་ནི་མེ་ཏོག་གཏོར་བ་ཡང་།
en: The flowers scattered by the devas

source: །ས་སྟེང་ལྷ་ཡི་མེ་ཏོག་བཀྲམ་པར་གྱུར།
en: Were strewn on the ground as divine flowers. {30}

source: །ལྷ་དང་མི་དང་གྲུལ་བུམ་སྲིན་པོ་རྣམས།
en: The devas, humans, kumbhāṇḍas, and rākṣasas

source: །དེ་མཐོང་ནས་ནི་ནམ་ཡང་ངོམས་མི་མྱོང་།
en: Never tired of gazing upon him.

source: །མགོན་པོ་སྟོབས་བཅུ་ལྡན་པ་མཐོང་ནས་ཀྱང་།
en: When they saw the Lord with the ten strengths,

source: །རབ་ཏུ་དགའ་ཞིང་སེམས་བདེ་རངས་པར་གྱུར།
en: They were overjoyed and felt the highest delight. {31}

source: །ནམ་ཚེ་སྐྱེས་བུ་མཆོག་གི་སྐུ་མཐོང་ནས།
en: When they saw the body of the supreme being,

source: །སེམས་ཅན་ཐམས་ཅད་དགའ་མགུ་རངས་གྱུར་པས།
en: All beings were overjoyed and delighted;

source: །ལྷ་ཡི་མེ་ཏོག་ལ་ཡང་ཡིད་མི་སེམས།
en: They did not even think of the divine flowers,

source: །དེ་དག་ལ་ནི་ངོ་མཚར་འཛིན་པ་མེད།
en: Which did not seem at all wonderful. {32}

source: །སྟོབས་བཅུའི་གཡས་ཕྱོགས་ན་ནི་ཚངས་པ་སྟེ།
en: Brahmā upon the right of the one with ten strengths,

source: །དེ་བཞིན་གཡོན་ན་བརྒྱ་བྱིན་ལྷ་ཡི་རྒྱལ།
en: Śakra, the king of the devas, on his left,

source: །ནམ་མཁའི་དཀྱིལ་ན་ལྷ་མང་བྱེ་འཁོད་དེ།
en: And the many millions of deities in the middle of the sky

source: །སྐྱེས་བུ་མཆོག་ལ་ཤིན་ཏུ་གུས་པ་སྐྱེད།
en: Showed great veneration to the supreme being. {33}

source: །ལྷ་དང་ལྷ་མིན་དག་གིས་རྒྱལ་བར་བསྐོར།
en: Devas and asuras encircled the Jina,

source: །ལྷ་དང་མི་ཡི་དཔལ་གཟི་ཀུན་ཕྲོགས་ནས།
en: Who eclipsed all the majesty of devas and humans.

source: །ཞབས་མཐིལ་ས་ལ་རི་མོ་འབྱིན་བཞིན་དུ།
en: With the soles of his feet making patterns on the ground,

source: །གྲོང་ཁྱེར་དུ་ནི་བཅོམ་ལྡན་སྤྱན་དྲངས་གཤེགས།
en: The invited Bhagavān entered into the city. {34}

source: །སྐུ་ལུས་དཔེ་བྱད་བཟང་པོས་བརྒྱན་པ་ནི།
en: His body was beautified by excellent primary signs,

source: །ནམ་མཁའ་སྐར་མ་དག་གིས་གང་བ་བཞིན།
en: Like the firmament filled with stars. The Buddha shone upon the king’s road

source: །ནམ་མཁའ་ལ་ནི་ཟླ་བ་ཉ་བ་ལྟར། །རྒྱལ་པོའི་ལམ་ན་སངས་རྒྱས་ལམ་མེ་བཞུགས།
en: Like the full moon in the sky. {35}

source: །ནོར་བུ་རིན་ཆེན་རྣམ་དག་བཟང་པོ་ནི།
en: Just as an excellent, pure, precious jewel

source: །ཉེས་པའི་སྐྱོན་བྲལ་རབ་ཏུ་སྣང་བར་བྱེད།
en: That is free of all impurities shines

source: །ཕྱོགས་དང་ཕྱོགས་མཚམས་སུ་ཡང་འོད་གཙང་བྱུང་།
en: So that a pure light goes in all directions,

source: །དེ་བཞིན་རྒྱལ་བ་འཇིག་རྟེན་ཀུན་སྣང་མཛད།
en: In that way the Jina illuminated the entire world. {36}

source: །ལྷ་དང་ལྷ་མིན་དག་གིས་རྒྱལ་བ་བསྐོར།
en: Devas and asuras encircled the Jina.

source: །མི་ཡི་གཙོ་བོ་རྒྱལ་པོའི་ཁབ་ཏུ་གཤེགས།
en: The supreme human who entered Rājagṛha

source: །ཟླ་འོད་གཞོན་ནུའི་ཁྱིམ་དུ་སངས་རྒྱས་གཤེགས།
en: The Buddha, came to the home of the youth Candraprabha. {37}

source: །གྲོང་ཁྱེར་མཆོག་ནི་ཀུན་ཏུ་ལེགས་བརྒྱན་ཏེ།
en: The supreme city was perfectly adorned,

source: །རྒྱལ་མཚན་བྱེ་བ་ཕྲག་སྟོང་རབ་ཏུ་སྒྲེང་།
en: Millions of banners had been erected,

source: །དེ་ཡི་ས་ཀུན་སྤོས་བཟང་རྣམ་པར་བྱུགས།
en: The entire ground was anointed with the best perfumes,

source: །ཡིད་འོང་དེ་བཞིན་དབྱར་གྱི་མེ་ཏོག་གཏོར།
en: And beautiful summer flowers were scattered. {38}

source: །གང་ཚེ་བདེ་གཤེགས་གཏམ་རྣམས་སྟོན་པ་ན།
en: When the Sugata spoke to teach

source: །མགོན་པོ་སྲང་བཞུད་མི་ལ་ཐུགས་བརྩེའི་ཕྱིར།
en: With compassion for the people in the streets, The Jina manifested emanations That taught to them the excellent Dharma of the Buddha. {39} [

source: །རྒྱལ་བས་དེར་ནི་འཕྲུལ་པ་རྣམ་སྤྲུལ་ཏེ། །དེ་དག་ལ་ཡང་སངས་རྒྱས་ཆོས་བཟང་སྟོན།
en: The Jina manifested emanations; Bodies that were like gold were manifested. The Buddha, the Jina, through his emanations, Remained in emptiness, peace, the enlightenment of buddhahood.] {40}

source: །སྲོག་ཆགས་བརྒྱ་སྟོང་དག་གིས་དེ་ཐོས་ནས།
en: When the hundreds of thousands of beings heard that,

source: །སངས་རྒྱས་ཡེ་ཤེས་མཆོག་ལ་སྨོན་ལམ་འདེབས།
en: They prayed for the supreme wisdom of the Buddha,

source: །ནམ་བདག་འདི་འདྲའི་ཡེ་ཤེས་ཐོབ་སྙམ་སྟེ།
en: Wondering, “When will I attain this kind of wisdom?”

source: །བསམ་པ་མཁྱེན་ནས་རྒྱལ་བ་ལུང་ཡང་སྟོན། །གང་གིས་རྒྱལ་བ་མི་དབང་སྤྱན་དྲངས་པ།
en: Knowing their thoughts, the Jina prophesied to them. {41}

source: །སྦྱིན་པ་དེ་ནི་མུ་མཐའ་མེད་གྱུར་པ།
en: There were those who aspired to attain

source: །རྙེད་མཆོག་བསམ་གྱིས་མི་ཁྱབ་དེས་རྙེད་ཅེས།
en: That inconceivable supreme attainment. They had invited the Jina, the Lord of men,

source: །ལ་ལ་དག་ནི་དེ་ལ་མོས་པ་སྐྱེད། །འཁོར་བ་དག་ན་ཤིན་ཏུ་མཐོང་དཀའ་བ།
en: And there was no limit to the offerings they made. {42}

source: །སྐྱེ་དགུ་དག་ལ་ཕན་མཛད་ཐུགས་ཀྱང་བརྩེ།
en: There were those who developed an excellent aspiration,

source: །ཐུགས་རྗེ་ཅན་དེ་བདག་གིས་སང་ལ་ཡང་།
en: Thinking, “I will tomorrow invite the compassionate one, He who wishes to benefit beings,

source: །སྤྱན་དྲང་སྙམ་དུ་ལ་ལ་སེམས་ཀྱང་སྐྱེད།
en: Whom it is difficult to see in saṃsāra.” {43}

source: །ལ་ལ་བ་གམ་ཅོག་གི་སྟེང་འདུག་ཅིང་། །ལུས་ནི་ཤིན་ཏུ་སྡུག་ཅིང་མཛེས་པར་བརྒྱན།
en: Some who were upon the roofs

source: །བྱང་ཆུབ་སེམས་མཆོག་དམ་པ་བསྐྱེད་ནས་ནི།
en: Developed the sublime, supreme aspiration to enlightenment

source: །སྟོབས་བཅུ་ལྡན་ལ་ལྷ་ཡི་མེ་ཏོག་འཐོར།
en: And they scattered divine flowers on the handsome, Beautifully adorned body of the one with the ten strengths. {44}

source: །ལ་ལས་བླ་མེད་སེམས་མཆོག་རབ་བསྐྱེད་ནས།
en: Some developed the supreme, highest aspiration

source: །མེ་ཏོག་ཙམ་པ་མཛེས་པའི་ཕྲེང་བ་དང་། །ཨ་ཏི་མུག་ཏ་དེ་བཞིན་དབྱར་གྱི་སྤོས།
en: And scattered garlands of magnolias, Kachnar flowers, the scents of summer,

source: །དར་གྱི་ལྡ་ལྡི་དག་ཀྱང་ལ་ལ་འཐོར།
en: And wreaths of silken ribbons. {45}

source: །ཁ་ཅིག་གོས་ཀྱིས་ཤིན་ཏུ་ལུས་བརྒྱན་ཏེ། །མེ་ཏོག་བཟང་པོ་དག་ཀྱང་ཐོགས་ཤིང་འགྲེང་།
en: Some stood, holding excellent flowers, Their bodies perfectly beautified by their raiment.

source: །མེ་ཏོག་སྣ་ཚོགས་དར་གྱི་ལྡ་ལྡི་ཐོགས།
en: They held various flowers and wreaths of silk

source: །རྒྱལ་བ་ཐུབ་ཆེན་དེ་ཡི་ཕྱོགས་སུ་འཐོར།
en: That they cast in the direction of the Jina with great power. {46}

source: །ལ་ལ་པད་མ་དང་ནི་ཀུ་མུ་ད།
en: Some scattered red lotuses, night lotuses,

source: །ཨུད་པལ་གསེར་གྱི་མེ་ཏོག་བཟང་པོ་འཐོར།
en: Blue lotuses, and excellent golden flowers.

source: །ལ་ལ་རིན་ཆེན་མེ་ཏོག་དེར་འཐོར་ཏེ།
en: Some scattered precious flowers,

source: །ལ་ལ་ཙན་དན་ཕྱེ་མ་འཐོར་བར་བྱེད།
en: And some scattered sandalwood powder. {47}

source: །ངོ་མཚར་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱང་བྱུང་།
en: The wonders that appeared were uncountable,

source: །མཚུངས་མེད་དེ་དག་བརྗོད་པར་མི་ནུས་ཏེ།
en: Unequaled, impossible to describe,

source: །སངས་རྒྱས་ཡེ་ཤེས་སྐྱེ་བོ་བྱེ་མང་བཀོད།
en: And they brought many millions of beings to buddha wisdom. {48}

source: །མི་ཆེ་མི་གདུང་བདེན་པ་མཐོང་བ་དང་། །གཞན་ཡང་གྱ་ནོམ་སྣང་དང་ཤིན་ཏུ་མཐོང་།
en: Those in Avṛha, Atapa, who had seen the truth, The devas of Sudṛśa and Sudarśana,

source: །དེ་བཞིན་འོག་མིན་འདོད་ཆགས་བྲལ་བ་རྣམས།
en: And those in Akaniṣṭha, who are free of desire—

source: །ཐམས་ཅད་མི་དབང་བལྟ་ཕྱིར་ཉེ་བར་ལྷགས།
en: They all came to see the Lord of humans. {49}

source: །དེ་བཞིན་དགེ་བའི་ལྷ་རྣམས་དཔག་མེད་དང་། །དགེ་ཆུང་ལྷ་གཞན་དག་ཀྱང་སེམས་དགའ་ཞིང་།
en: Similarly, countless Parī­ttaśubha devas, Apramāṇaśubha devas, filled with joy,

source: །དགེ་རྒྱས་ཁྲག་ཁྲིག་དཔག་ཏུ་མེད་པ་རྣམས།
en: And countless millions of Śubhakṛtsna devas

source: །འདྲེན་པ་དྲང་སྲོང་ཆེན་པོ་ལྟ་ཕྱིར་ལྷགས།
en: Came to see the Guide, the great Rishi. {50}

source: །ཚད་མེད་འོད་ཀྱང་དེ་བཞིན་དཔག་མེད་དང་། །འོད་ཆུང་གི་ནི་ལྷ་རྣམས་ཅི་ཡོད་དང་། །འོད་གསལ་བ་ཡང་ཁྲག་ཁྲིག་མང་པོ་དེར།
en: Countless Apramāṇābha devas, And similarly the Parī­ttābha devas, And countless millions of Ābhāsvara devas

source: །འཇིག་རྟེན་མགོན་པོ་བལྟ་ཕྱིར་དེ་དག་ལྷགས།
en: Came to see the Lord of the World. {51}

source: །ཚངས་འཁོར་བ་དག་བརྒྱ་སྟོང་མང་པོ་དང་། །ཚངས་པའི་འདུན་འདོན་དད་པ་དེ་བཞིན་ཏེ།
en: Many hundreds of thousands of Brahmā’s entourage, And similarly the faithful Brahmapurohita devas

source: །ཚངས་རིས་ཀྱང་ནི་བརྒྱ་ཕྲག་མང་པོ་རྣམས།
en: And many hundreds of Brahmakāyika devas,

source: །ཐམས་ཅད་འདྲེན་པ་བལྟ་ཕྱིར་ཉེ་བར་ལྷགས།
en: All came so as to see the Guide. {52}

source: །དེ་བཞིན་གཞན་འཕྲུལ་གྱི་ཡང་ལྷ་རྣམས་དང་། །གཞན་ཡང་འཕྲུལ་དགའི་སེམས་ཅན་དག་པ་དང་། །དགའ་ལྡན་འཐབ་བྲལ་ལྷ་རྣམས་རབ་དགའ་ཞིང་།
en: Also the Para­nirmita­vaśa­vartin devas, And the pure beings who dwell in Nirmāṇaratin, And the joyful devas of Tuṣita and Yāma

source: །ཐམས་ཅད་སངས་རྒྱས་ཕྱག་འཚལ་ཉེ་བར་ལྷགས།
en: All came to pay homage to the Buddha. {53}

source: །བརྒྱ་བྱིན་ལྷ་རྒྱལ་སུམ་ཅུ་རྩ་གསུམ་པ།
en: Śakra, king of the devas, and the Trāyastriṃśa devas

source: །ལྷ་ཡི་བུ་མོ་བྱེ་བ་བརྒྱ་དག་ལྷགས།
en: Came with hundreds of millions of apsarases

source: །འདིར་ནི་མེ་ཏོག་ཆར་ཀྱང་རབ་འབེབས་ཤིང་།
en: And they sent down a rain of flowers,

source: །སངས་རྒྱས་ཐུབ་དབང་བལྟ་ཕྱིར་ཉེ་བར་ལྷགས།
en: Having come to see the Buddha, the Lord of sages. {54}

source: །ཕྱོགས་བཞིའི་འཇིག་རྟེན་སྐྱོང་བ་བཞི་པོ་ཡང་།
en: Also the world guardians of the four directions

source: །རྣམ་ཐོས་བུ་དང་ཀླུ་དབང་མིག་མི་བཟང་།
en: Vaiśravaṇa, Dhṛtarāṣṭra the nāga king,

source: །ཡུལ་འཁོར་སྲུང་དང་འཕགས་སྐྱེས་སེམས་དགའ་སྟེ།
en: Virūḍhaka, and Virūpākṣa, their minds filled with joy,

source: །དེ་ཀུན་མི་དབང་བསྟོད་ཅིང་ཉེ་བར་ལྷགས།
en: All came in order to praise the Lord of men. {55}

source: །གནོད་སྦྱིན་རྒྱལ་པོ་མཐུ་ལྡན་ཨིར་བིར་ཡང་།
en: Ailavila, the powerful king of the yakṣas,

source: །དགའ་བ་སྐྱེས་ཤིང་གནོད་སྦྱིན་བརྒྱས་བསྐོར་ཏེ།
en: With a delighted mind and encircled by a hundred yakṣas,

source: །ནམ་མཁའི་དཀྱིལ་ན་འདུག་ཅིང་སེམས་དགའ་ནས།
en: Was in the middle of the sky and joyfully

source: །མེ་ཏོག་སྣ་ཚོགས་དུ་མའི་ཆར་ཀྱང་འབེབས།
en: They sent down a rain of numerous various flowers. {56}

source: །རྟག་ཏུ་མྱོས་དང་ཕྲེང་འཛིན་ལྷ་རྣམས་ཀྱང་།
en: Also the Sadāmatta and Mālādhāra devas,

source: །སྤོས་དང་ཕྲེང་བ་རྣམ་པ་སྣ་ཚོགས་ཐོགས།
en: Holding various kinds of incense and flowers,

source: །འཁོར་དང་བཅས་པ་ཐམས་ཅད་སེམས་དགའ་ཞིང་།
en: With their retinues, all joyful,

source: །དེ་ན་སྐྱེས་བུ་མཆོག་ལ་མཆོད་པ་བྱེད།
en: Made offerings there to the supreme individual. {57}

source: །གནོད་སྦྱིན་ལག་ན་གཞོང་ཐོགས་མང་པོ་ཡང་།
en: Also numerous Karoṭapāṇi yakṣas

source: །གནོད་སྦྱིན་བུ་མོ་དེ་དག་རབ་བརྒྱན་ཏེ།
en: And adorned yakṣa maidens

source: །གནོད་སྦྱིན་རོལ་མོ་རབ་ཏུ་སྙན་པ་དང་། །ཤིན་ཏུ་ཡིད་འོང་བརྒྱས་ནི་སངས་རྒྱས་མཆོད།
en: Made offerings to the Buddha With hundreds of compositions of The beautiful, melodious music of the yakṣas. {58} Druma, the king of the kinnaras, With thousands of kinnara maidens skilled

source: །གླུ་དབྱངས་སིལ་སྙན་འཇམ་ཞིང་སྙན་པ་ལ། །མཁས་པ་མི་འམ་ཅི་ཡི་བུ་མོ་སྟོང་། །མི་འམ་ཅི་ཡི་རྒྱལ་པོ་ལྗོན་པ་ཡང་།
en: In sweet and melodious songs and music,

source: །རྒྱལ་མཆོག་མཆོད་པར་སྤོས་ངད་ལྡང་ལས་ལྷགས།
en: Arrived from Gandhamādana to make offerings to the supreme Jina. {59}

source: །བདེ་མཆོག་སྟོབས་ལྡན་སྒྲ་གཅན་ཐགས་བཟང་རིས།
en: Śambara, Bala, Vemacitra, and Rāhu,

source: །ལྷ་མིན་བུ་མོ་སྟོང་གི་འཁོར་བཅས་དང་། །ལྷ་མིན་རྫུ་འཕྲུལ་ཆེན་པོ་གཞན་མང་ཡང་།
en: Together with an entourage of thousands of asura maidens, And together with crowds of other powerful asuras,

source: །རིན་པོ་ཆེ་ཡི་ཆར་ཕབ་ཉེ་བར་ལྷགས།
en: Came and sent down a rain of jewels. {60}

source: །སྲིན་པོ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་མཐའ་ཡས་ཀྱང་།
en: From countless trillions of rākṣasas

source: །སྲིན་པོ་བྱེ་བ་བརྒྱ་ཡིས་བསྙེན་བཀུར་ཞིང་།
en: A thousand million rākṣasas honored him.

source: །མེ་ཏོག་སིལ་མ་སྣ་ཚོགས་མང་པོ་ཡང་། །སྐྱེས་བུ་མཆོག་ལ་གུས་པར་རབ་ཏུ་འཐོར།
en: They respectfully scattered a multitude of various Flower petals upon the supreme individual. {61}

source: །ཀླུ་ཡི་རྒྱལ་པོ་རི་བོ་ལེགས་པ་ཡང་།
en: The nāga king Girivalgu,

source: །འཁོར་མང་དེ་བཞིན་གཤེགས་པའི་དྲུང་དུ་ལྷགས།
en: With a great entourage came before the Tathāgata,

source: །རིན་ཆེན་མེ་ཏོག་རྣམ་མང་མཆོག་ཐོགས་ཏེ།
en: Holding great numbers of perfect, precious flowers,

source: །བདེ་གཤེགས་ཞབས་གཉིས་ལ་ནི་རབ་ཏུ་འདུད།
en: And bowed down at the Sugata’s feet. {i}

source: །ཀླུ་དབང་པད་མ་དང་ནི་པད་མ་ཆེ།
en: The nāga lords Padma and Mahāpadma,

source: །དེ་བཞིན་ནོར་ཡོད་མཐའ་ཡས་གདེངས་ཀ་ཅན།
en: And also Vāsuki, Ananta, and Phanaka,

source: །དེ་དག་ཁྱུ་མཆོག་དྲུང་དུ་ཉེར་ལྷགས་ཏེ།
en: Came before the great leader

source: །བདེ་བར་གཤེགས་ལ་གུས་པས་རབ་ཏུ་འདུད།
en: And respectfully bowed to the Sugata. {ii}

source: །ཀླུ་ཡི་རྒྱལ་པོ་ནོར་བུ་ཡིད་དགའ་ཞིང་།
en: The nāga king Maṇi, filled with joy,

source: །ཁྱུ་མཆོག་ཞབས་ཀྱི་དྲུང་དུ་ཉེ་བར་འོངས།
en: Came before the feet of the great leader

source: །ཀླུ་ཡི་མེ་ཏོག་དྲི་ཞིམ་མཆོག་ཐོགས་ཏེ།
en: Holding fragrant, perfect nāga flowers

source: །ཧ་ཅང་མི་རིང་བདེ་གཤེགས་སྤྱན་སྔར་འདུག །དེ་བཞིན་མ་དྲོས་ཀླུ་ཡི་རྒྱལ་པོ་ཡང་།
en: And sat before the Sugata at no great distance. {iii} Also the nāga king Anavatapta,

source: །ཀླུ་ཡི་བུ་མོ་ཤིན་ཏུ་བསླབས་པའི་མཆོག །རྔ་དང་སིལ་སྙན་སྟོང་ཕྲག་བརྒྱ་བརྡུང་ཞིང་།
en: With perfectly trained nāga maidens Playing a hundred thousand musical instruments and drums,

source: །འཇིག་རྟེན་མགོན་པོ་མཆོད་ཕྱིར་ཉེ་བར་ལྷགས།
en: Came and made offerings there to the Lord of the World. {62}

source: །མ་དྲོས་པ་ཡི་བུ་ཕོ་ལྔ་བརྒྱ་དག །ཡེ་ཤེས་ཡངས་པ་བླ་མེད་ཚོལ་བའི་ཕྱིར།
en: The five hundred sons of Anavatapta,

source: །གཉེན་འདབ་དག་གིས་བསྐོར་ཅིང་དགར་གྱུར་ནས།
en: Encircled by their kindred and filled with joy, Seeking the highest, vast wisdom,

source: །རང་གིས་རང་བྱུང་མཆོད་ཕྱིར་ཉེ་བར་ལྷགས།
en: Came to make offerings to the self-arisen one. {63}

source: །དེ་བཞིན་ཀླུ་ཡི་རྒྱལ་པོ་སོག་མེད་ཀྱང་།
en: Similarly, the nāga king Apalāla,

source: །སྐྱེས་བུ་མཆོག་ལ་ཐར་སྦྱར་རབ་བཏུད་ནས།
en: Palms together, bowed to the supreme individual

source: །ཀླུ་ཡི་མུ་ཏིག་མཛེས་ཤིང་བཟང་བ་ཐོགས།
en: Holding beautiful, excellent nāga pearls.

source: །མཁའ་ལ་འདུག་ནས་ཐུབ་རྒྱལ་མཆོད་པ་བྱེད།
en: He remained in the sky, making offerings to the king of sages. {64}

source: །དེ་བཞིན་ཀླུ་ཡི་རྒྱལ་པོ་བཏང་བཟུང་ཡང་།
en: Similarly, the nāga king Mucilinda,

source: །རབ་ཏུ་ཡིད་བདེ་དགའ་མགུ་སྐྱེས་ནས་ནི།
en: With great happiness and filled with joy,

source: །རིན་ཆེན་མུ་ཏིག་སྣ་ཚོགས་ཐོགས་ནས་སུ།
en: Holding various jewels and pearls,

source: །དེར་འོངས་འདྲེན་པ་ལ་ཡང་མངོན་པར་འཐོར།
en: Came and scattered them for the Guide. {65}

source: །དེ་བཞིན་ཀླུ་ཡི་རྒྱལ་པོ་དུས་ཅན་ཡང་།
en: Similarly, the nāga king Kālika

source: །དེ་བཞིན་གཤེགས་པའི་དྲུང་དུ་ཉེར་འོངས་ཏེ།
en: Came before the Tathāgata.

source: །དགའ་ཞིང་རིན་ཆེན་ཕྲེང་བ་མཛེས་མཆོག་ཐོགས།
en: Joyful and holding perfect, beautiful strings of jewels,

source: །སྐྱེས་བུ་དམ་པ་ལ་ཡང་མཆོད་རབ་བྱས།
en: He made offerings to the supreme individual. {66}

source: །དེ་ཡང་བདེ་གཤེགས་ཡོན་ཏན་རྗེས་དྲན་ཞིང་། །གུས་པ་ཆེན་པོ་ཤིན་ཏུ་བསྐྱེད་ནས་ནི།
en: He felt great veneration as he thought Of the qualities of the Tathāgata.

source: །གཉེན་འདབ་ཀླུ་མང་དག་གིས་དེ་བསྐོར་ཅིང་།
en: Encircled by his many nāga kindred,

source: །འདྲེན་པའི་བསྔགས་པ་རྣམ་པ་མང་པོ་བརྗོད།
en: He recited many praises of the Guide. {67}

source: །དེ་བཞིན་ཀླུ་དབང་དགའ་བོ་ཉེ་དགའ་དང་། །དེ་བཞིན་འཇོག་པོ་གཽ་ཏམ་ནག་པོ་ཡང་།
en: Similarly, the nāga kings Nanda and Upananda— Similarly, also, Takṣaka and Kṛṣṇagautama—

source: །རྒྱལ་བ་བལྟ་ཞིང་དེར་ནི་ཉེ་བར་འོངས།
en: Came there gazing upon the Jina

source: །བདེ་བར་གཤེགས་པའི་ཞབས་ལ་འདུད་པ་བྱེད།
en: And bowed down to the Sugata’s feet. {68}

source: །ཀླུ་ཡི་རྒྱལ་པོ་ཨེ་ལའི་འདབ་མ་ཡང་།
en: The nāga king Elapatra

source: །ཐུབ་མཆོག་རྒྱལ་བ་འོད་སྲུང་དྲན་པ་དང་། །བདག་ཉིད་མི་ཁོམ་སྐྱེས་པ་མཐོང་ནས་ནི། །ཀླུ་བརྒྱས་ཡོངས་སུ་བསྐོར་ཏེ་ངུ་ཞིང་འོངས།
en: Came weeping, encircled by a hundred nāgas. He remembered the supreme sage Jina Kāśyapa And saw what an unfavorable rebirth he himself had obtained. {69}

source: །ཀྱེ་མ་བདག་སྔོན་ཐེ་ཚོམ་བྱུང་གྱུར་ཏེ།
en: “Alas! I had doubts in the past.

source: །བདག་གིས་ཨེ་ལའི་འདབ་སྡོང་སྔོན་བཅད་པས།
en: In the past I cut down an elapatra bush,

source: །དེས་ནི་མི་ཁོམ་པར་ཡང་བདག་སྐྱེས་ཏེ།
en: And therefore I obtained this unfavorable rebirth.

source: །རྒྱལ་བའི་ཆོས་ནི་རིག་པར་སླ་བ་མིན།
en: It is not easy to know the Dharma of the Jina. {70}

source: །ཤིན་ཏུ་སྨད་པའི་སྐྱེ་བོའི་ལུས་འདི་དང་། །ཀླུ་ཡི་སྐྱེ་གནས་བདག་གིས་རབ་སྤངས་ལ།
en: “I forsake this rebirth into a nāgī’s womb, And this birth in an extremely detestable body. I will realize the Dharma, the state of peace,

source: །ཆོས་གང་བྱང་ཆུབ་སྙིང་པོར་སྐྱེས་མཆོག་གིས། །རྟོགས་པ་བསིལ་བ་བདག་གིས་རྟོགས་པར་བྱ།
en: That the best of men realized in the Bodhimaṇḍa.” {71}

source: །ཀླུ་ཡི་རྒྱལ་པོ་རྒྱ་མཚོ་འཁོར་ལོས་སྒྱུར།
en: Sāgara, the nāga cakravartin king,

source: །བྱེ་བ་གསུམ་སྙེད་ཀླུ་ཡི་འཁོར་གྱིས་བསྐོར།
en: Accompanied by an entourage of thirty million nāgas,

source: །ཆུ་ལྷ་གཟི་ཅན་རིན་ཆེན་དོ་ཤལ་ཐོགས།
en: And the majestic Varuṇa, holding necklaces of jewels,

source: །བཅོམ་ལྡན་འདས་ལ་མཆོད་ཕྱིར་ཉེ་བར་འོངས།
en: Came in order to make offerings to the Bhagavān. {72}

source: །རྒྱལ་བ་ལ་ནི་རྡོ་འཕངས་དེས་བཟུང་སྟེ།
en: The yakṣa of Rājagṛha who caught

source: །དེ་ཚེ་ནམ་མཁའ་ལ་ཡང་འདུག་གྱུར་པ།
en: While he was in the sky

source: །རྒྱལ་པོའི་ཁབ་ཀྱི་གནོད་སྦྱིན་ཅི་ཞིག་འཛིན།
en: The rock thrown at the Buddha

source: །བདེ་བར་གཤེགས་པའི་སྤྱན་སྔར་གུས་པར་འདུག །ལྕང་ལོ་ཅན་གྱི་རྒྱལ་པོའི་གནས་ཀུན་ཀྱང་།
en: Was respectfully present before the Sugata. {73} The entire domain of the king of Alakavatī

source: །སྟོང་པར་གྱུར་ཅིང་གནོད་སྦྱིན་གང་ཡང་མེད།
en: Became empty, with no yakṣa remaining there.

source: །ཐམས་ཅད་ཀྱིས་ཀྱང་ཕན་ཚུན་དམ་བཅས་ཏེ།
en: They had all promised each other

source: །འཇིག་རྟེན་མགོན་པོ་བལྟ་བར་ཐམས་ཅད་ལྷགས།
en: To come and see the Lord of the World. {74}

source: །དེ་བཞིན་བོང་རྣ་དང་ནི་ཁབ་སྤུ་དང་། །གནོད་སྦྱིན་འབྲོག་གནས་འཇིགས་བྱེད་དེ་བཞིན་ཏེ།
en: In the same way, Kharakarṇa and Sūciromā, The terrifying yakṣas of the forests,

source: །གངས་གནས་རིར་འདུ་གནོད་སྦྱིན་བོང་བུ་དག །རྒྱལ་བ་རང་བྱུང་དྲུང་དུ་ཉེ་བར་ལྷགས།
en: And the yakṣa Gardabhaka, who lives in the snow mountains, Had come into the presence of the self-arisen Jina. {75} Indraketu, Vikaṭa, and Surūpa,

source: །དབང་པོའི་ཏོག་དང་གཟུགས་བཟང་རད་རོད་ཅན།
en: Bakula, Pañcika, and Śākyavardhana,

source: །བཀྐུ་ལ་དང་དུས་འཕེལ་ལྔ་པོ་དང་། །གནོད་སྦྱིན་དབང་པོ་གཞན་ཡང་སྟོང་རྣམས་ནི།
en: And a thousand other yakṣa lords

source: །བདུག་སྤོས་སྣོད་རྣམས་ཐོགས་ཤིང་ཉེ་བར་ལྷགས།
en: Came holding censers of incense. {76}

source: །ལུས་དབྱིབས་མ་ལེགས་མི་སྡུག་མང་པོ་རྣམས།
en: Many with ugly, misshapen bodies,

source: །གཟུགས་ཀྱི་རྣམ་པ་མང་ཞིང་རྒྱན་བོར་བ།
en: Many kinds of bodies, destitute of adornment,

source: །དེ་ཡི་མདུན་ན་བརྒྱ་སྟོང་མང་པོ་དག །གནོད་སྦྱིན་གྱི་ནི་མེ་ཏོག་ཐོགས་ཏེ་ལྷགས།
en: In their hundreds of thousands Came into his presence, holding yakṣa flowers. {77}

source: །གཽ་ཏམ་རི་བྱི་ཕུར་བུ་རྒྱལ་བྱེད་དང་། །ཀཽ་ཤི་ཀ་དང་འོད་སྲུང་མཱརྐཎྜ།
en: Gautama, Rishi Bṛhaspati, and Jahnu, Kauśika, Kāśyapa, and Markandeya,

source: །ཐམས་ཅད་བཤེས་དང་པར་ཤ་གར་གཱ་དག །ཐམས་ཅད་སངས་རྒྱས་ཕྱག་འཚལ་ཉེ་བར་ལྷགས།
en: Viśvāmitra, Parāśara, and Gargā, They all came to pay homage to the Buddha. {i}

source: །མི་སྦྱིན་ཡང་ནི་དེ་བཞིན་དགའ་མགུ་སྟེ།
en: And similarly, there were the joyous and enraptured Nārada,

source: །དྲང་སྲོང་རྒྱས་པ་ཀུད་ཙ་ཨང་གི་ར།
en: And the rishis Vyāsa, Kutsa, and Aṅgiras,

source: །ཤེད་ཅན་ངན་སྤོང་བད་ཙ་གནས་འཇོག་རྣམས།
en: And Manu, Bhṛgu, Vātsyāyana, and Vaśiṣṭha,

source: །དེ་དག་སངས་རྒྱས་ཕྱག་འཚལ་ཉེ་བར་ལྷགས།
en: Who came to pay homage to the Buddha. {ii}

source: །འཛའ་མན་བཱ་མན་བེའི་ཤམ་བཱ་ཡ་དང་། །འཛའ་མག་ནཱི་དང་གྲོག་མཁར་དྲང་སྲོང་མཆོག །དཀར་བར་གནས་དང་མིའུ་ཐུང་སྤེན་པ་རྣམས།
en: Jaimini, Vāmana, and Vaiśampāyana, Jamadagni and supreme rishi Vālmīki, Durvāsa, and also Cyavana

source: །འདྲེན་པ་བལྟ་ཞིང་གྲོང་ཁྱེར་མཆོག་ཏུ་ལྷགས།
en: Came to the supreme city to see the Guide. {iii}

source: །དྲང་སྲོང་མཐོང་ནས་དེ་ཚེ་དྲང་སྲོང་དགའ།
en: When they saw the Rishi, the rishis were overjoyed

source: །ཐུབ་རྒྱལ་ཞབས་མཆོག་ལ་ནི་ཕྱག་འཚལ་ཞིང་།
en: And they bowed down to the feet of the king of sages.

source: །འཇིག་རྟེན་སྒྲོན་ལ་ཕྱག་བྱས་མངོན་བསྟོད་དེ།
en: They paid homage to the lamp of the world and praised him,

source: །ཐལ་མོ་སྦྱར་ནས་དཔའ་བོའི་སྤྱན་སྔར་འགྲེང་།
en: Standing before the Hero with palms placed together. {iv}

source: །འཇིག་རྟེན་ཅི་ཡོད་དྲང་སྲོང་མང་པོ་ཀུན།
en: The entire multitude of rishis in the world

source: །དེ་དག་མི་དབང་བལྟ་བར་ཉེར་ལྷགས་ཏེ།
en: Came in order to see the Lord of men.

source: །མཐོང་ནས་མཆོད་པ་རྒྱ་ཆེར་བྱས་ནས་ཀྱང་།
en: When they saw him they made vast offerings

source: །སངས་རྒྱས་སྤྱན་སྔར་ཐལ་མོ་རབ་སྦྱར་འདུག །
en: And stood before him with palms placed together. {v}

source: རྒྱ་མཚོ་དག་ན་གནས་པའི་ནམ་མཁའ་ལྡིང་།
en: The garuḍas that live at the ocean’s shore

source: །བྲམ་ཟེའི་ཆ་བྱད་དུ་ཡང་སྤྲུལ་བྱས་ནས།
en: Came, having transformed into the appearance of brahmins.

source: །ཅོད་པན་སྣ་ཚོགས་བལྟ་ན་སྡུག་པ་ཐོགས།
en: Holding various beautiful kinds of crowns

source: །བདེ་བར་གཤེགས་ལ་ཕྱག་འཚལ་ནམ་མཁར་འཁོད།
en: And positioned in the sky, they paid homage to the Sugata. {78} All of the devas that dwell in Jambudvīpa,

source: །གྲོང་བརྒྱ་དང་ནི་འཛམ་གླིང་ནགས་ཚལ་ན།
en: Whether in hundreds of towns or in its forests,

source: །གནས་ཤིང་རྟེན་པའི་ལྷ་རྣམས་གང་ཡོད་དང་། །གྲོང་གི་ལྷ་མོ་མ་ལུས་ཐམས་ཅད་ཀྱང་།
en: And all the goddesses of the towns

source: །ཉེ་བར་ལྷགས་ཤིང་གཙོ་བོ་མཆོད་པར་བྱེད།
en: Came and made offerings to the Lord. {79}

source: །ནགས་ཚལ་གྱི་ཡང་ལྷ་རྣམས་མཐའ་ཡས་དང་། །རི་ཡི་ལྷ་རྣམས་ཐམས་ཅད་ཉེ་བར་འོངས།
en: The countless devas of the forests And all the mountain devas came,

source: །འབབ་ཆུའི་ལྷ་ཀུན་མཐའ་དག་དེ་བཞིན་དུ།
en: And also the countless devas of rivers

source: །འདྲེན་པ་མཆོད་པ་བྱེད་ཅིང་ཉེ་བར་ལྷགས།
en: Arrived to make offerings to the Guide. {80}

source: །མྱ་ངམ་དགོན་པའི་ལྷ་མོ་བརྒྱ་རྣམས་དང་། །རི་རྩེའི་ལྷ་མོ་ཇི་སྙེད་མ་ལུས་དང་། །མཚོ་དང་ཆུ་མིག་རྫིང་གི་ལྷ་རྣམས་དང་། །རྒྱ་མཚོའི་ལྷ་ཡང་སངས་རྒྱས་དྲུང་དུ་ལྷགས།
en: The hundreds of devas of desert wildernesses, All the devas of mountain peaks, The devas of lakes, springs, and ponds, And the devas of the ocean came into the Buddha’s presence. {81}
